Усложняем условие задачи https://github.com/artmaro/java-homework/blob/master/lec_4_class/homework/practice/ShoppingEasy.java

1. Цены на различные товары могут вычисляться по разному. Например, фрукты считаются по цене за килограмм, а хлеб поштучно. 
2. В магазине могут действовать скидки выходного дня на определенные группы товаров. 
Например, если вы покупаете в выходные чай, вы получаете скидку 20% от цены. Это потребует от вас ввести дату покупки.
3. Учтите специальный вид скидок: купи две единицы товара и получи третий бесплатно.
