package lec_18_stream.homework;

/**
Задача: дан ряд от 1 до n, четные элементы ряда необходимо возвести в куб, а нечетные элементы необходимо возвести в квадрат.
 Далее надо посчитать среднее значение среди всех элементов полученного ряда(квадратов и кубов) и из каждого элемента вычесть это среднее значение.
 Из получившего ряда необхомо отбросить все отрицательные и нечетные элементы и результирующую последовательность отсортировать по убыванию.

 Пример:
 1 2 3 4 -> 1 8 9 64 -> avg = 20 -> -19 -12 -11 44 -> 44

 */
public class IntegerShuffle {
}
